 # Project 7: Explanatory Data Analysis & Advanced Visualization (Baby Names Dataset)

In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
pd.options.display.float_format = '{:.2f}'.format

### The most popular names

In [7]:
df = pd.read_csv('us_baby_names.csv')

In [8]:
df.columns

Index(['Year', 'Name', 'Gender', 'Count'], dtype='object')

This is the non-unique values in each column

In [6]:
df.nunique()

Year        139
Name      98400
Gender        2
Count     13720
dtype: int64

Converting gender as categorical type

In [9]:
df['Gender'] = df['Gender'].astype('category')

Dataframe with names of 2018

In [10]:
df_names_2018 = df[df['Year'] == 2018].copy()

The most counted names

In [15]:
df_names_2018.nlargest(10,'Count')

         Year      Name Gender  Count
1943042  2018      Liam      M  19837
1925013  2018      Emma      F  18688
1943043  2018      Noah      M  18267
1925014  2018    Olivia      F  17921
1925015  2018       Ava      F  14924
1943044  2018   William      M  14516
1925016  2018  Isabella      F  14464
1925017  2018    Sophia      F  13928
1943045  2018     James      M  13525
1943046  2018    Oliver      M  13389

The most counted female names

In [16]:
df_names_2018[df_names_2018['Gender'] == 'F'].nlargest(10,'Count')

         Year       Name Gender  Count
1925013  2018       Emma      F  18688
1925014  2018     Olivia      F  17921
1925015  2018        Ava      F  14924
1925016  2018   Isabella      F  14464
1925017  2018     Sophia      F  13928
1925018  2018  Charlotte      F  12940
1925019  2018        Mia      F  12642
1925020  2018     Amelia      F  12301
1925021  2018     Harper      F  10582
1925022  2018     Evelyn      F  10376

The most counted male names

In [17]:
df_names_2018[df_names_2018['Gender'] == 'M'].nlargest(10,'Count')

         Year      Name Gender  Count
1943042  2018      Liam      M  19837
1943043  2018      Noah      M  18267
1943044  2018   William      M  14516
1943045  2018     James      M  13525
1943046  2018    Oliver      M  13389
1943047  2018  Benjamin      M  13381
1943048  2018    Elijah      M  12886
1943049  2018     Lucas      M  12585
1943050  2018     Mason      M  12435
1943051  2018     Logan      M  12352

In [ ]:
def most_pop(year,gender,n):
    conditions = True
    conditions &= df['Year']   == year
    conditions &= df['Gender'] == gender
    return df[conditions].nlargest(n,'Count')